
//&НаКлиенте
//Процедура Печать(Команда)
//	ТабДок = Новый ТабличныйДокумент;
//	ПечатьНаСервере(ТабДок);
//	ТабДок.Показать();
//КонецПроцедуры

//&НаСервере
//Процедура ПечатьНаСервере(ТабДок)
//	
//	МассивОбъектов = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СсылкаНаОбъект);
//	ОбъектыПечати = Новый СписокЗначений;
//	ОбъектОбработка = РеквизитФормыВЗначение("Объект");
//	ТабДок = ОбъектОбработка.СформироватьПечатнуюФормуГарантийноеПисьмо(МассивОбъектов, ОбъектыПечати);
//	
//КонецПроцедуры

