#Область ПрограммныйИнтерфейс

&НаКлиенте
Процедура ВыполнитьКоманду(ИдентификаторКоманды, ОбъектыНазначенияМассив, СозданныеОбъекты) Экспорт
	////отладку делать в Толстом клиенте
	//ПутьКВнешнейОбработке = "D:\Разработка 1С\ПрактикаДопОтчИОбрАйрон\СозданиеСчетовСРазделением.epf";
	//ОбъектОбработки = ВнешниеОбработки.Создать(ПутьКВнешнейОбработке,БезопасныйРежим());
	//ФормаОбработки = ОбъектОбработки.ПолучитьФорму("ВнешняяОбработка.СозданиеСчетовСРазделением_УНФ_3_0.Форма");
	//ФормаОбработки.ВыполнитьКоманду(ИдентификаторКоманды, ОбъектыНазначенияМассив, СозданныеОбъекты);
	//Возврат;
	
	Если ОбъектыНазначенияМассив.Количество() > 0 Тогда
		Заказ = ОбъектыНазначенияМассив[0];
		СоздатьСчетаНаОплату(Заказ);
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СоздатьСчетаНаОплату(СсылкаНаОбъект)
	
	СчетТовары = Документы.СчетНаОплату.СоздатьДокумент();
	СчетТовары.Заполнить(СсылкаНаОбъект);
	СчетТовары.Дата = ТекущаяДатаСеанса();
	
	МассивТоваров = СчетТовары.Запасы.ВыгрузитьКолонку("Номенклатура");
	РеквизитыТоваров = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(МассивТоваров,"ТипНоменклатуры");
	
	МассивСтрокКУдалению = Новый Массив;
	Для Каждого СтрокаТЧ Из СчетТовары.Запасы Цикл
		
		ТипНоменклатуры = РеквизитыТоваров[СтрокаТЧ.Номенклатура];
		Если ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.Запас Тогда
			 МассивСтрокКУдалению.Добавить(СтрокаТЧ)
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаТаблицы Из МассивСтрокКУдалению Цикл
		СчетТовары.Запасы.Удалить(СтрокаТаблицы);
	КонецЦикла;
	
	
	СчетУслуги = Документы.СчетНаОплату.СоздатьДокумент();
	СчетУслуги.Заполнить(СсылкаНаОбъект);
	СчетУслуги.Дата = ТекущаяДатаСеанса();
	
	МассивСтрокКУдалению.Очистить();
	Для Каждого СтрокаТЧ Из СчетУслуги.Запасы Цикл
		
		ТипНоменклатуры = РеквизитыТоваров[СтрокаТЧ.Номенклатура];
		Если ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас Тогда
			 МассивСтрокКУдалению.Добавить(СтрокаТЧ)
		КонецЕсли;
	КонецЦикла;

	Для Каждого СтрокаТаблицы Из МассивСтрокКУдалению Цикл 
		СчетУслуги.Запасы.Удалить(СтрокаТаблицы);
	КонецЦикла;
	
	
	Если СчетТовары.Запасы.Количество() > 0 Тогда
		Попытка
		СчетТовары.Записать(РежимЗаписиДокумента.Проведение);
		ОбщегоНазначения.СообщитьПользователю("Создан счет за товары " + Строка(СчетТовары.Ссылка));
	Исключение
		ТекстСообщения = "Не удалось записать счет на товары по причине: " + ОписаниеОшибки();
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецПопытки;
	КонецЕсли;
	
	Если СчетУслуги.Запасы.Количество() > 0 Тогда
		Попытка
		СчетУслуги.Записать(РежимЗаписиДокумента.Проведение);
		ОбщегоНазначения.СообщитьПользователю("Создан счет за услуги " + Строка(СчетУслуги.Ссылка));
	Исключение
		ТекстСообщения = "Не удалось записать счет на товары по причине: " + ОписаниеОшибки();
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
