#Область ПрограммныйИнтерфейс

Функция СведенияОВнешнейОбработке() Экспорт
	
	ИмяОтчета = ЭтотОбъект.Метаданные().Имя; 
	Синоним = ЭтотОбъект.Метаданные().Синоним; 
	Синоним = ?(ЗначениеЗаполнено(Синоним),Синоним, ИмяОтчета);
	
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке();
	ПараметрыРегистрации.Вид			 = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительныйОтчет();
	ПараметрыРегистрации.Наименование	 = Синоним;                                                                     
	ПараметрыРегистрации.Версия			 = "1.0.0.1";
	ПараметрыРегистрации.БезопасныйРежим = Ложь;
	ПараметрыРегистрации.Информация		 = "Отчет """ + Синоним + """";
	
	// для изменения формы отчета нужно удалить комментарий со строки ниже,
	// а изменения формы описать в процедуре ОпределитьНастройкиФормы()
	
	//ПараметрыРегистрации.ОпределитьНастройкиФормы = Истина;
	
	Команда = ПараметрыРегистрации.Команды.Добавить();
	Команда.Представление = Синоним;
	Команда.Идентификатор = ИмяОтчета;
	Команда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
	Команда.ПоказыватьОповещение = Истина;
	
	Возврат ПараметрыРегистрации; 
	
КонецФункции

#КонецОбласти                          

#Область ДополнительныйПрограммныйИнтерфейс

// Настройки общей формы отчета подсистемы "Варианты отчетов".
//
// Параметры:
// Форма - ФормаКлиентскогоПриложения, Неопределено - Форма отчета или форма настроек отчета.
// 			Неопределено, когда вызов без контекста.
// КлючВарианта - Строка, Неопределено - Имя предопределенного
// 				или уникальный идентификатор пользовательского варианта отчета.
// 				Неопределено, когда вызов без контекста.
// Настройки - Структура - см. возвращаемое значение
//			 ОтчетыКлиентСервер.ПолучитьНастройкиОтчетаПоУмолчанию().
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	
КонецПроцедуры

#КонецОбласти