#Область ПрограммныйИнтерфейс

Функция СведенияОВнешнейОбработке() Экспорт
    	
	ИмяОбработки = ЭтотОбъект.Метаданные().Имя; 
    Синоним = ЭтотОбъект.Метаданные().Синоним; 
    Синоним = ?(ЗначениеЗаполнено(Синоним),Синоним, ИмяОбработки);
	
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке();
	ПараметрыРегистрации.Вид			 = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиСозданиеСвязанныхОбъектов();
	ПараметрыРегистрации.Версия			 = "1.0.0.1";
	ПараметрыРегистрации.Наименование	 = Синоним;
	ПараметрыРегистрации.БезопасныйРежим = Ложь;
	ПараметрыРегистрации.Информация		 = "Создание на основании";
	
	ПараметрыРегистрации.Назначение.Добавить("Документ.ЗаказПокупателя");
	
	Команда = ПараметрыРегистрации.Команды.Добавить();
	Команда.Представление		 = Синоним;
	Команда.Идентификатор		 = ИмяОбработки;
	Команда.Использование		 = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовКлиентскогоМетода();
	Команда.ПоказыватьОповещение = Истина;
    
    Возврат ПараметрыРегистрации; 

КонецФункции

#КонецОбласти