#Область ПрограммныйИнтерфейс

Функция СведенияОВнешнейОбработке() Экспорт
    		
	ИмяОбработки = ЭтотОбъект.Метаданные().Имя; 
    Синоним = ЭтотОбъект.Метаданные().Синоним; 
    Синоним = ?(ЗначениеЗаполнено(Синоним),Синоним, ИмяОбработки);
	
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("2.2.2.1");
	ПараметрыРегистрации.Вид			 = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиЗаполнениеОбъекта();
	ПараметрыРегистрации.Версия			 = "1.0.0.1";
	ПараметрыРегистрации.Наименование	 = "Рассчитать скидки в заказе поставщику";
	ПараметрыРегистрации.БезопасныйРежим = Ложь;
	ПараметрыРегистрации.Информация		 = "Обработка заполнения";
	
	ПараметрыРегистрации.Назначение.Добавить("Документ.ЗаказПоставщику");
	
	Команда = ПараметрыРегистрации.Команды.Добавить();
	Команда.Представление		 = Синоним;
	Команда.Идентификатор		 = ИмяОбработки;
	Команда.Использование		 = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыЗаполнениеФормы();
	Команда.ПоказыватьОповещение = Истина;
    
    Возврат ПараметрыРегистрации; 
	
КонецФункции

Процедура ВыполнитьКоманду(ИмяКоманды, ОбъектыНазначения, ПараметрыВыполнения) Экспорт
	
	//ПутьКВнешнейОбработке = "D:\Разработка 1С\ПрактикаДопОтчИОбрАйрон\РассчитатьСкидкиПриЗаказеПоставщику.epf";
	//ОбъектОбработки = ВнешниеОбработки.Создать(ПутьКВнешнейОбработке);
	//ОбъектОбработки.ВыполнитьКоманду(ИмяКоманды, ОбъектыНазначения, ПараметрыВыполнения);
	//Возврат;
	
	ФормаДокумента = ПараметрыВыполнения.ЭтаФорма;
	
	Для Каждого СтрокаЗапасы Из ФормаДокумента.Объект.Запасы Цикл
		Если СтрокаЗапасы.Количество > 50 Тогда
			СтрокаЗапасы.ПроцентСкидкиНаценки = 10;
			ПараметрыРасчета = Новый Структура("РассчитатьСуммуСкидки", Истина);
			ПараметрыРасчета.Вставить("СуммаВключаетНДС",ФормаДокумента.Объект.СуммаВключаетНДС);
			ТабличныеЧастиУНФКлиентСервер.РассчитатьСуммыВСтрокеТЧ(СтрокаЗапасы, ПараметрыРасчета);
			
		КонецЕсли;
		
	КонецЦикла;
	
	ФормаДокумента.Модифицированность = Истина;
	
	ТекстСообщения = НСтр("ru = 'Скидки успешно рассчитаны...'");
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

#КонецОбласти
