
&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
    ТаблицаКонтрагентов.Очистить();
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.Наименование КАК Наименование,
		|	Контрагенты.НаименованиеПолное КАК НаименованиеПолное,
		|	Контрагенты.ИНН КАК ИНН,
		|	Контрагенты.КПП КАК КПП,
		|	Контрагенты.НомерТелефонаДляПоиска КАК НомерТелефонаДляПоиска
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	НЕ Контрагенты.ЭтоГруппа
		|	И НЕ Контрагенты.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтрокаТаблицы = ТаблицаКонтрагентов.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы,Выборка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура Выгрузить(Команда)
	
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	МассивФайлов = Ждать Диалог.ВыбратьАсинх();
	
	Если МассивФайлов <> 0 Тогда
		Каталог = МассивФайлов[0]; 
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.ОткрытьФайл(Каталог + "\clients.json");
		
		МассивДанных = Новый Массив;
		
		Для Каждого СтрокаТаблицы Из ТаблицаКонтрагентов  Цикл
			СтруктураДанных = Новый Структура("Наименование,НаименованиеПолное,ИНН,КПП,НомерТелефонаДляПоиска");
			ЗаполнитьЗначенияСвойств(СтруктураДанных,СтрокаТаблицы);
			
			МассивДанных.Добавить(СтруктураДанных);
			
		КонецЦикла;
		
		ЗаписатьJSON(ЗаписьJSON,МассивДанных);
		ЗаписьJSON.Закрыть();
		
		 ОбщегоНазначенияКлиент.СообщитьПользователю("Выгрузка данных завершена...");
		
	КонецЕсли;
	
КонецПроцедуры
